{
    "buffer kit": "Reduces recoil and improves firearm reliability by controlling the buffer movement inside the receiver.",
    "stripped lower": "Essential components for assembling the lower receiver of a firearm, such as the trigger assembly, bolt catch, and magazine release.",
    "trigger": "Mechanical component responsible for releasing the hammer or striker, which ignites the gunpowder and fires the ammunition.",
    "stock": "A stock is the part of a gun that rests against the shooter's shoulder, providing stability and support while aiming and firing the firearm.",
    "pistol grip": "A pistol grip is the handle of a firearm that is designed to be gripped by the shooter's hand. It provides a more ergonomic and comfortable grip on the firearm.",
    "stripped upper": "The stripped upper is the top portion of the AR-15 rifle that houses the bolt carrier group, charging handle, and barrel.",
    "forward assist": "A forward assist is a small button located on the upper receiver of the AR-15 rifle that can help push the bolt carrier group forward and chamber a round in case of a jam.",
    "dust cover": "A dust cover is a small metal plate that covers the ejection port of the AR-15 rifle and helps keep dust and debris from entering the receiver.",
    "barrel": "The barrel is the long, metal tube through which the bullet travels when fired. It is one of the most important components of a firearm, as it determines the accuracy, range, and power of the bullet.",
    "handguard": "A handguard is a component of a firearm that is designed to protect the shooter's hands from the heat generated by the barrel during firing.",
    "gas tube": "A gas tube is a small metal tube that connects the gas block to the upper receiver of an AR-15 rifle. It channels the hot gases generated by firing the round back into the action to cycle the bolt carrier group.",
    "gas block": "A gas block is a component of an AR-15 rifle that is responsible for controlling the flow of hot gases generated by firing the round into the gas tube, which then cycles the bolt carrier group.",
    "bcg": "BCG stands for bolt carrier group, which is a critical component of an AR-15 rifle. It houses the bolt, firing pin, and extractor, and is responsible for loading, firing, and extracting the spent shell casing from the rifle.",
    "charging handle": "A charging handle is a small lever located on the rear of the upper receiver of an AR-15 rifle. It is used to manually cycle the bolt carrier group, which loads a round into the chamber and prepares the rifle for firing."
}